###################################################################

# Created by write_sdc on Sun Jun 24 02:30:43 2018

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -power mW -voltage V       \
-current mA
set_load -pin_load 0.05 [get_ports out_valid]
set_load -pin_load 0.05 [get_ports {out_data[20]}]
set_load -pin_load 0.05 [get_ports {out_data[19]}]
set_load -pin_load 0.05 [get_ports {out_data[18]}]
set_load -pin_load 0.05 [get_ports {out_data[17]}]
set_load -pin_load 0.05 [get_ports {out_data[16]}]
set_load -pin_load 0.05 [get_ports {out_data[15]}]
set_load -pin_load 0.05 [get_ports {out_data[14]}]
set_load -pin_load 0.05 [get_ports {out_data[13]}]
set_load -pin_load 0.05 [get_ports {out_data[12]}]
set_load -pin_load 0.05 [get_ports {out_data[11]}]
set_load -pin_load 0.05 [get_ports {out_data[10]}]
set_load -pin_load 0.05 [get_ports {out_data[9]}]
set_load -pin_load 0.05 [get_ports {out_data[8]}]
set_load -pin_load 0.05 [get_ports {out_data[7]}]
set_load -pin_load 0.05 [get_ports {out_data[6]}]
set_load -pin_load 0.05 [get_ports {out_data[5]}]
set_load -pin_load 0.05 [get_ports {out_data[4]}]
set_load -pin_load 0.05 [get_ports {out_data[3]}]
set_load -pin_load 0.05 [get_ports {out_data[2]}]
set_load -pin_load 0.05 [get_ports {out_data[1]}]
set_load -pin_load 0.05 [get_ports {out_data[0]}]
create_clock [get_ports clk]  -period 9  -waveform {0 4.5}
set_input_delay -clock clk  0  [get_ports clk]
set_input_delay -clock clk  0  [get_ports rst_n]
set_input_delay -clock clk  4.5  [get_ports in_valid]
set_input_delay -clock clk  4.5  [get_ports {in_A[3]}]
set_input_delay -clock clk  4.5  [get_ports {in_A[2]}]
set_input_delay -clock clk  4.5  [get_ports {in_A[1]}]
set_input_delay -clock clk  4.5  [get_ports {in_A[0]}]
set_input_delay -clock clk  4.5  [get_ports {in_B[3]}]
set_input_delay -clock clk  4.5  [get_ports {in_B[2]}]
set_input_delay -clock clk  4.5  [get_ports {in_B[1]}]
set_input_delay -clock clk  4.5  [get_ports {in_B[0]}]
set_output_delay -clock clk  4.5  [get_ports out_valid]
set_output_delay -clock clk  4.5  [get_ports {out_data[20]}]
set_output_delay -clock clk  4.5  [get_ports {out_data[19]}]
set_output_delay -clock clk  4.5  [get_ports {out_data[18]}]
set_output_delay -clock clk  4.5  [get_ports {out_data[17]}]
set_output_delay -clock clk  4.5  [get_ports {out_data[16]}]
set_output_delay -clock clk  4.5  [get_ports {out_data[15]}]
set_output_delay -clock clk  4.5  [get_ports {out_data[14]}]
set_output_delay -clock clk  4.5  [get_ports {out_data[13]}]
set_output_delay -clock clk  4.5  [get_ports {out_data[12]}]
set_output_delay -clock clk  4.5  [get_ports {out_data[11]}]
set_output_delay -clock clk  4.5  [get_ports {out_data[10]}]
set_output_delay -clock clk  4.5  [get_ports {out_data[9]}]
set_output_delay -clock clk  4.5  [get_ports {out_data[8]}]
set_output_delay -clock clk  4.5  [get_ports {out_data[7]}]
set_output_delay -clock clk  4.5  [get_ports {out_data[6]}]
set_output_delay -clock clk  4.5  [get_ports {out_data[5]}]
set_output_delay -clock clk  4.5  [get_ports {out_data[4]}]
set_output_delay -clock clk  4.5  [get_ports {out_data[3]}]
set_output_delay -clock clk  4.5  [get_ports {out_data[2]}]
set_output_delay -clock clk  4.5  [get_ports {out_data[1]}]
set_output_delay -clock clk  4.5  [get_ports {out_data[0]}]
